public class 20170228_Question {

    /*
     * <2진수 더하기>
    두개의 이진수(0과 1로 이루어진 숫자)를 입력받은 다음 더하는 프로그램을 구현하라.
    기본적인 이진수의 덧셈은 다음과 같다.
    0 + 0 = 0
    1 + 0 = 1
    0 + 1 = 1
    1 + 1 = 10
    1 + 1 + 1 = 11
    만약 1011101과 0010010을 더하면 다음과 같이 덧셈이 이뤄진다.
    1 <- 자리올림
    1011101
    + 0010010
    1101111
    입력형식
    입력은 한 줄로 이루어지며 2개의 0과 1로 이루어진 이진수가 입력된다.
    이진수 사이에는 공백이 포함되어 있으며 이진수의 자릿수는 최대 80자리 이하이며 앞에 0이 붙는 경우도 존재한다.
    출력형식
    입력된 두개의 이진수를 더한 결과를 출력한다.
    앞자리에 0이 붙어 나올 경우 이 경우는 앞의 0은 모두 출력한다.
    만약 두개의 숫자를 더한 값이 0일 경우에는 0을 하나만 출력한다.
    
    입력 예시
    1001101 10010

    출력예시
    1011111
     */

    public static void main(String[] args) throws Exception{

    }
}